zhaohuaxiaoy/folo-ai-passport-voice/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 的所有硬件批次均使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 烧录时按实际探测容量回写镜像头。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 本 demo UI 简单,24KB 足够;若自建复杂界面出现绘制卡死/看门狗,调大此值。
CONFIG_LV_MEM_SIZE_KILOBYTES=24

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- Bluetooth LE / NimBLE(BLE 直连音频外设)---
# 参考 origin/demo/claude-buddy-port 已验证的 NimBLE 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_UTIL_API=y
# Just Works 配对(SC 无 MITM,无需输 PIN);macOS 主动发起,此配置让配对兜底
# (代码侧需 ble_store_config_init 持久化 bond)。
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
# 协商 ATT MTU 517(含 3B 头 → 载荷 514B):3200B 音频帧 = 7 片(6×514+116),
# 分片远少于 MTU 247 的 14 片,显著降低 NOTIFY_TX 流控开销(吞吐工程,见 design.md)。
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
# MSYS mbuf 池:默认 MSYS_2 为 292B×4 块,514B 载荷需 2 块链接才放得下,
# 并发分片下池易耗尽(ble_hs_mbuf_from_flat 失败 → 整帧丢弃,见第 5 轮 #1)。
# 640B = 514B 载荷 + mbuf/pkthdr 头(~44B) + 余量,单片一块、链接归零。
# 4×640B ≈ 2.5KB 静态 RAM,代价可接受;实际池行为真机验证(NOT RUN)。
CONFIG_BT_NIMBLE_MSYS_2_BUF_SIZE=640
